## Dependencies or libraries are pre-written code to help solve problems

# Pandas

In [10]:
import pandas
#csvfile_path='C:\Users\lenovo\Downloads\Sample-Spreadsheet-1000-rows.csv'
df=pandas.read_csv(r"C:\Users\lenovo\Downloads\Sample-Spreadsheet-1000-rows.csv",encoding='Windows-1252')
print(df.head())

   1   Eldon Base for stackable storage shelf, platinum Muhammed MacIntyre  \
0  2  1.7 Cubic Foot Compact "Cube" Office Refrigera...       Barry French
1  3   Cardinal Slant-DÂ® Ring Binder, Heavy Gauge Vinyl       Barry French
2  4                                               R380      Clay Rozendal
3  5                           Holmes HEPA Air Purifier     Carlos Soltero
4  6  G.E. Longer-Life Indoor Recessed Floodlight Bulbs     Carlos Soltero

     3  -213.25   38.94     35  Nunavut          Storage & Organization   0.8
0  293   457.81  208.16  68.02  Nunavut                      Appliances  0.58
1  293    46.71    8.69   2.99  Nunavut  Binders and Binder Accessories  0.39
2  483  1198.97  195.99   3.99  Nunavut    Telephones and Communication  0.58
3  515    30.94   21.78   5.94  Nunavut                      Appliances  0.50
4  515     4.43    6.64   4.95  Nunavut              Office Furnishings  0.37

In [12]:
#for importing excel
df=pandas.read_excel(r"C:\Users\lenovo\Downloads\heapsortgraph.xlsx")
df.head()

   39.000000   186.000000  206.130687
0          42         173  226.477332
1          52         273  296.422865
2          71         415  436.632045
3          72         424  444.234600
4         116         844  795.525795

the result is stored in dataframes, df in this example,
now we have data in our dtaframe we can use it.

## creating a dataframe out of a dictionary

In [21]:
import pandas as pd
dict={"Album":["The pinkprint","pink friday","queen"]
      ,"year":[2014,2012,2018],
      "rating":[5,4,4]}
album_dataframe=pd.DataFrame(dict)
album_dataframe

           Album  year  rating
0  The pinkprint  2014       5
1    pink friday  2012       4
2          queen  2018       4

In [22]:
#making a dataframe from existing data frame
new_df=album_dataframe[['Album']]
new_df
new_df2=album_dataframe[["Album","rating"]]
new_df2

           Album  rating
0  The pinkprint       5
1    pink friday       4
2          queen       4

## now if we want to list out all unique values in a dataframe we can
we have method unique

In [26]:
new_df2["rating"].unique()

SyntaxError: invalid syntax (4075854415.py, line 2)

## working with dataframe manipulation

In [31]:
record={"Album":["The pinkprint","Thanku next","pink friday",\
                  "queen","planet her","sweetener"]
      ,"year":[2014,2019,2012,2018,2021,2018],
      "rating":[5,5,4,4,4,5]}
df=pd.DataFrame(record)
df

#now to get all the record albums that were 
#releaased after the year 2014 we can do
#first select the released column values as  required
df["year"]>=2014

#this gives boolean true false
# now to get the entire coulmns we put in in df[...]

df1=df[df["year"]>=2014]
df1
#this is a new dataframe with all albums 
#released after 2014.

           Album  year  rating
0  The pinkprint  2014       5
1    Thanku next  2019       5
3          queen  2018       4
4     planet her  2021       4
5      sweetener  2018       5

## saving dataframes as csv
.to_csv(..)

In [33]:
df.to_csv("albumcsv.csv")

In [36]:
type(df1)

#to get all the values of a column as series
x=df["Album"]
x

0    The pinkprint
1      Thanku next
2      pink friday
3            queen
4       planet her
5        sweetener
Name: Album, dtype: object

<code>loc()</code> and <code>iloc()</code> functions
<code>loc()</code> is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for your understanding: 

 - loc[row_label, column_label]

In [43]:
df
df.iloc[3,0]
#or with loc
df.loc[3,"Album"]

'queen'

## to change the index of column of a dataframe
The second line dfcopy=dfcopy.set_index("Album") sets the "Album" column as the new index for the dfcopy DataFrame. This means that the rows will now be identified by the values in the "Album" column rather than by a default integer index.

In [48]:
dfcopy=df
dfcopy=dfcopy.set_index("Album")
dfcopy

               year  rating
Album
The pinkprint  2014       5
Thanku next    2019       5
pink friday    2012       4
queen          2018       4
planet her     2021       4
sweetener      2018       5